{
  "imagesByCategory": {
    "living": ["https://images.unsplash.com/photo-1493809842364-78817add7ffb?auto=format&fit=crop&w=800&q=80", "https://images.unsplash.com/photo-1502672023488-70e25813eb80?auto=format&fit=crop&w=800&q=80", "https://images.unsplash.com/photo-1445019980597-93fa8acb246c?auto=format&fit=crop&w=800&q=80"],
    "bedroom": ["https://images.unsplash.com/photo-1496417263034-38ec4f0b665a?auto=format&fit=crop&w=800&q=80", "https://images.unsplash.com/photo-1519710164239-da123dc03ef4?auto=format&fit=crop&w=800&q=80", "https://images.unsplash.com/photo-1472220625704-91e1462799b2?auto=format&fit=crop&w=800&q=80"],
    "dining": ["https://images.unsplash.com/photo-1522708323590-d24dbb6b0267?auto=format&fit=crop&w=800&q=80", "https://images.unsplash.com/photo-1484154218962-a197022b5858?auto=format&fit=crop&w=800&q=80", "https://images.unsplash.com/photo-1542314831-068cd1dbfeeb?auto=format&fit=crop&w=800&q=80"]
  },
  "titlesAndDescriptionsByCategory": {
    "living": {
      "titles": ["Modern Sofa Set", "Elegant Coffee Table", "Comfort Recliner Chair", "Minimalist Bookshelf", "Stylish Floor Lamp", "Cozy Area Rug", "Wooden TV Stand", "Decorative Wall Art", "Contemporary Side Table", "Soft Throw Pillows"],
      "descriptions": [
        "A stylish sofa set that enhances any living room ambiance. Built with durable materials and designed for comfort, it's perfect for families and guests alike. The upholstery offers a soft touch, while the frame ensures longevity. A centerpiece for your home decor.",
        "Coffee table crafted with premium materials and sleek design. Its smooth surface makes it ideal for drinks, books, or decor pieces. A versatile addition to both modern and classic interiors. Sturdy construction ensures daily use without wear.",
        "Recliner chair with plush cushions for ultimate relaxation. Offers multiple reclining positions and ergonomic support. The fabric is both soft and easy to clean. Great for cozy evenings or afternoon naps.",
        "Bookshelf with a minimalist design perfect for modern homes. Features multiple tiers for books, plants, or decor. Compact yet spacious, fitting seamlessly into tight spaces. A touch of functionality and elegance combined.",
        "Floor lamp providing warm and adjustable lighting. Its slim frame allows easy placement in corners or near sofas. Designed with energy efficiency in mind. Adds ambiance to any room with its soft glow.",
        "Area rug with soft texture and contemporary patterns. Perfect for grounding your living room furniture. Easy to clean and resistant to daily wear. Brings warmth and style to your floor.",
        "TV stand with ample storage and elegant wood finish. Includes shelves and compartments for media devices. Cable management system for a clutter-free look. Complements both modern and rustic interiors.",
        "Wall art that adds character and charm to your space. High-resolution prints on durable canvas. Easy to hang and instantly elevates your walls. Available in various sizes to suit your decor.",
        "Side table designed to complement your living room decor. Offers both style and functionality with a compact footprint. Ideal for drinks, books, or lamps. Built with quality materials and clean lines.",
        "Throw pillows that add comfort and color to any sofa. Made with soft fabrics and filled for extra support. Easily mix and match with other cushions. Machine-washable covers for convenience."
      ],
      "fullDescriptions": ["Embodying the raw, wayward spirit of rock ‘n’ roll, the Kilburn portable active stereo speaker takes the unmistakable look and sound of Marshall, unplugs the chords, and takes the show on the road.", "Weighing in under 7 pounds, the Kilburn is a lightweight piece of vintage styled engineering. Setting the bar as one of the loudest speakers in its class, the Kilburn is a compact, stout-hearted hero with a well-balanced audio which boasts a clear midrange and extended highs for a sound that is both articulate and pronounced. The analogue knobs allow you to fine tune the controls to your personal preferences while the guitar-influenced leather strap enables easy and stylish travel."]
    },
    "bedroom": {
      "titles": ["Luxury King Bed", "Compact Nightstand", "Soft Cotton Sheets", "Elegant Dresser", "Cozy Mattress Topper", "Modern Wardrobe", "Adjustable Reading Lamp", "Decorative Mirror", "Comfortable Armchair", "Warm Bedside Rug"],
      "descriptions": [
        "King bed with plush upholstery and sturdy frame. Designed for maximum comfort and a luxurious sleep experience. Includes headboard detailing and solid wooden legs. The centerpiece of any master bedroom.",
        "Nightstand with drawers for convenient bedside storage. Compact design fits any bedroom layout. Keeps essentials like books, glasses, and devices within reach. Smooth finish adds a touch of class.",
        "High-quality cotton sheets for a restful night's sleep. Breathable and soft on the skin, suitable for all seasons. Machine washable and fade-resistant. Adds a touch of hotel-like comfort to your room.",
        "Dresser featuring multiple drawers with smooth finishes. Offers ample storage for clothes, linens, and accessories. Sleek metal handles provide a modern touch. Built to last with durable construction.",
        "Mattress topper that adds extra comfort and support. Filled with memory foam that adapts to your body shape. Improves sleep quality and extends mattress life. Hypoallergenic and breathable material.",
        "Spacious wardrobe with modern design and finishes. Includes hanging space, drawers, and shelves. Keeps your clothes and accessories neatly organized. Elevates your room’s storage capacity and style.",
        "Reading lamp with adjustable brightness settings. Flexible arm for directing light exactly where needed. Energy-efficient and compact in size. A must-have for every nightstand or study corner.",
        "Mirror with elegant frame to enhance your bedroom. Perfect for dressing or adding visual space. Available in full-length and wall-mounted styles. Complements various decor themes effortlessly.",
        "Armchair designed for comfort and style. Cushioned seat and back support your body for long sits. Ideal for reading or relaxing by the window. Upholstered with high-quality, soft-touch fabric.",
        "Soft bedside rug to keep your feet warm and cozy. Non-slip backing for added safety. Enhances the overall ambiance of your room. Easy to clean and resistant to wear."
      ],
      "fullDescriptions": ["Embodying the raw, wayward spirit of rock ‘n’ roll, the Kilburn portable active stereo speaker takes the unmistakable look and sound of Marshall, unplugs the chords, and takes the show on the road.", "Weighing in under 7 pounds, the Kilburn is a lightweight piece of vintage styled engineering. Setting the bar as one of the loudest speakers in its class, the Kilburn is a compact, stout-hearted hero with a well-balanced audio which boasts a clear midrange and extended highs for a sound that is both articulate and pronounced. The analogue knobs allow you to fine tune the controls to your personal preferences while the guitar-influenced leather strap enables easy and stylish travel."]
    },
    "dining": {
      "titles": ["Classic Dining Table", "Comfort Dining Chairs", "Glassware Set", "Elegant Table Runner", "Stylish Serving Tray", "Modern Bar Stools", "Cutlery Set", "Decorative Centerpiece", "Buffet Cabinet", "Placemats Set"],
      "descriptions": [
        "Dining table crafted for memorable meals and gatherings. Solid construction ensures stability and durability. Finished with elegant varnish for a timeless look. Accommodates up to 6 people comfortably.",
        "Chairs designed for comfort and elegance at your dining area. Ergonomic design supports posture during meals. Cushioned seat provides extended comfort. Made with premium wood and durable fabric.",
        "Set of glassware perfect for all occasions. Includes wine glasses, tumblers, and champagne flutes. Made of crystal-clear glass with elegant designs. Dishwasher-safe and perfect for entertaining guests.",
        "Table runner that adds sophistication to your dining table. Crafted from fine fabric with embroidered details. Suitable for casual and formal settings alike. Easily washable and fade-resistant.",
        "Serving tray with stylish design and practical use. Features handles for easy carrying and raised edges. Great for breakfast in bed or party service. Made from durable materials with smooth finish.",
        "Bar stools with modern look and sturdy build. Adjustable height and footrest for added comfort. Sleek metal base complements kitchen islands. Easy to assemble and maintain.",
        "Cutlery set made of premium stainless steel. Includes forks, knives, spoons, and teaspoons. Rust-resistant and dishwasher safe. Enhances dining experience with its elegant polish.",
        "Centerpiece to add charm and style to your table. Includes artificial florals and decorative stones. Brings freshness and balance to your setup. Ideal for holidays, dinners, or everyday decor.",
        "Buffet cabinet for storing your dining essentials. Features spacious compartments and drawers. Keeps dishes, linens, and glassware organized. Stylish piece that complements your dining room.",
        "Placemats set that protects your table and adds color. Made of eco-friendly and easy-to-clean materials. Heat-resistant and non-slip backing. Ideal for everyday use or festive occasions."
      ],
      "fullDescriptions": ["Embodying the raw, wayward spirit of rock ‘n’ roll, the Kilburn portable active stereo speaker takes the unmistakable look and sound of Marshall, unplugs the chords, and takes the show on the road.", "nWeighing in under 7 pounds, the Kilburn is a lightweight piece of vintage styled engineering. Setting the bar as one of the loudest speakers in its class, the Kilburn is a compact, stout-hearted hero with a well-balanced audio which boasts a clear midrange and extended highs for a sound that is both articulate and pronounced. The analogue knobs allow you to fine tune the controls to your personal preferences while the guitar-influenced leather strap enables easy and stylish travel."]
    }
  }
}
